# словарь доступных животных для раздела "классы"
animals_classes = {"Дубонос": "Царство: Птицы", "Ушастый еж": "Царство: Животные", "Лебедь шипун": "Царство: Птицы",
                   "Чернозобая гагара": "Царство: Птицы", "Красношейная поганка": "Царство: Птицы"}
# словарь id для раздела "классы"
classes = {"1-2": "1 - 2 класс", "3-4": "3 - 4 класс", "5-7": "5 - 7 класс", "8-9": "8 - 9 класс",
           "10-11": "10 - 11 класс"}
# словарь id для раздела "регионы"
regions = {'1': 'Республика Адыгея', '2': 'Республика Алтай', '3': 'Республика Башкортостан', '4': 'Республика Бурятия',
           '5': 'Республика Дагестан', '6': 'Донецкая Народная Республика', '7': 'Республика Ингушетия',
           '8': 'Кабардино-Балкарская Республика', '9': 'Республика Калмыкия', '10': 'Карачаево-Черкесская Республика',
           '11': 'Республика Карелия', '12': 'Республика Коми', '13': 'Республика Крым',
           '14': 'Луганская Народная Республика', '15': 'Республика Марий Эл', '16': 'Республика Мордовия',
           '17': 'Республика Саха (Якутия)', '18': 'Республика Северная Осетия - Алания', '19': 'Республика Татарстан',
           '20': 'Республика Тыва', '21': 'Удмуртская Республика', '22': 'Республика Хакасия',
           '23': 'Чеченская Республика', '24': 'Чувашская Республика', '25': 'Алтайский край',
           '26': 'Забайкальский край', '27': 'Камчатский край', '28': 'Краснодарский край', '29': 'Красноярский край',
           '30': 'Пермский край', '31': 'Приморский край', '32': 'Ставропольский край', '33': 'Хабаровский край',
           '34': 'Амурская область', '35': 'Архангельская область', '36': 'Астраханская область',
           '37': 'Белгородская область', '38': 'Брянская область', '39': 'Владимирская область',
           '40': 'Волгоградская область', '41': 'Вологодская область', '42': 'Воронежская область',
           '43': 'Запорожская область', '44': 'Ивановская область', '45': 'Иркутская область',
           '46': 'Калининградская область', '47': 'Калужская область', '48': 'Кемеровская область',
           '49': 'Кировская область', '50': 'Костромская область', '51': 'Курганская область', '52': 'Курская область',
           '53': 'Ленинградская область', '54': 'Липецкая область', '55': 'Магаданская область',
           '56': 'Московская область', '57': 'Мурманская область', '58': 'Нижегородская область',
           '59': 'Новгородская область', '60': 'Новосибирская область', '61': 'Омская область',
           '62': 'Оренбургская область', '63': 'Орловская область', '64': 'Пензенская область',
           '65': 'Псковская область', '66': 'Ростовская область', '67': 'Рязанская область', '68': 'Самарская область',
           '69': 'Саратовская область', '70': 'Сахалинская область', '71': 'Свердловская область',
           '72': 'Смоленская область', '73': 'Тамбовская область', '74': 'Тверская область', '75': 'Томская область',
           '76': 'Тульская область', '77': 'Тюменская область', '78': 'Ульяновская область', '79': 'Херсонская область',
           '80': 'Челябинская область', '81': 'Ярославская область', '82': 'Еврейская АО', '83': 'Ненецкий АО',
           '84': 'Ханты-Мансийский АО', '85': 'Чукотский АО', '86': 'Ямало-Ненецкий АО'}


# класс для получения теории в разделе "классы"
class ClassAnimals:
    def __init__(self):
        self.id_class = "1-2"
        self.lines = ""
        # открываем файл с теорией и сохраняем построчно в self.lines
        with open("static/animals.txt", "r", encoding="utf-8") as file:
            self.lines = file.readlines()

    def get_text(self, id_animal):
        if self.id_class == "1-2" and id_animal == "Дубонос":
            return self.lines[1], "1-2/img.png"
        if self.id_class == "3-4" and id_animal == "Дубонос":
            return self.lines[3], "3-4/img.png"
        if self.id_class == "5-7" and id_animal == "Дубонос":
            return self.lines[5], "5-7/img.png"
        if self.id_class == "8-9" and id_animal == "Дубонос":
            return self.lines[7], "8-9/img.png"
        if self.id_class == "10-11" and id_animal == "Дубонос":
            return self.lines[9], "10-11/img.png"
        if self.id_class == "1-2" and id_animal == "Ушастый еж":
            return self.lines[11], "1-2/img_1.png"
        if self.id_class == "3-4" and id_animal == "Ушастый еж":
            return self.lines[13], "3-4/img_1.png"
        if self.id_class == "5-7" and id_animal == "Ушастый еж":
            return self.lines[15], "5-7/img_1.png"
        if self.id_class == "8-9" and id_animal == "Ушастый еж":
            return self.lines[17], "8-9/img_1.png"
        if self.id_class == "10-11" and id_animal == "Ушастый еж":
            return self.lines[19], "10-11/img_1.png"
        if self.id_class == "1-2" and id_animal == "Лебедь шипун":
            return self.lines[21], "1-2/img_2.png"
        if self.id_class == "3-4" and id_animal == "Лебедь шипун":
            return self.lines[23], "3-4/img_2.png"
        if self.id_class == "5-7" and id_animal == "Лебедь шипун":
            return self.lines[25], "5-7/img_2.png"
        if self.id_class == "8-9" and id_animal == "Лебедь шипун":
            return self.lines[27], "8-9/img_2.png"
        if self.id_class == "10-11" and id_animal == "Лебедь шипун":
            return self.lines[29], "10-11/img_2.png"
        if self.id_class == "1-2" and id_animal == "Чернозобая гагара":
            return self.lines[32], "1-2/img_3.png"
        if self.id_class == "3-4" and id_animal == "Чернозобая гагара":
            return self.lines[34], "3-4/img_3.png"
        if self.id_class == "5-7" and id_animal == "Чернозобая гагара":
            return self.lines[37], "5-7/img_3.png"
        if self.id_class == "8-9" and id_animal == "Чернозобая гагара":
            return self.lines[40], "8-9/img_3.png"
        if self.id_class == "10-11" and id_animal == "Чернозобая гагара":
            return self.lines[44], "10-11/img_3.png"
        if self.id_class == "1-2" and id_animal == "Красношейная поганка":
            return self.lines[31], "1-2/img_4.png"
        if self.id_class == "3-4" and id_animal == "Красношейная поганка":
            return self.lines[35], "3-4/img_4.png"
        if self.id_class == "5-7" and id_animal == "Красношейная поганка":
            return self.lines[38], "5-7/img_4.png"
        if self.id_class == "8-9" and id_animal == "Красношейная поганка":
            return self.lines[41], "8-9/img_4.png"
        if self.id_class == "10-11" and id_animal == "Красношейная поганка":
            return self.lines[43], "10-11/img_4.png"


# класс для получения теории в разделе "регионы"
class RegionsAnimals:
    def __init__(self):
        self.id_region = "60"
        self.animals_regions = {}
        self.animals_regions_test_name = {}
        self.animals_regions_test = {}
        self.lines = ""
        # открываем файл с теорией и сохраняем построчно в self.lines
        with open("static/animals.txt", "r", encoding="utf-8") as file:
            self.lines = file.readlines()

    def set_animals(self):
        if self.id_region == "60":
            self.animals_regions = {"Дубонос": "Царство: Птицы", "Ушастый еж": "Царство: Животные",
                                    "Лебедь шипун": "Царство: Птицы", "Чернозобая гагара": "Царство: Птицы",
                                    "Красношейная поганка": "Царство: Птицы"}
            self.animals_regions_test_name = {"Ушастый еж": "Царство: Животные"}
            self.animals_regions_test = {"Ушастый еж": "big-eared_hedgehog.html"}
        else:
            self.animals_regions = {"Пусто": "Животных пока нет"}
            self.animals_regions_test_name = {"Пусто": "Животных пока нет"}
            self.animals_regions_test = {}

    def get_text(self, id_animal):
        if id_animal == "Дубонос":
            return self.lines[5], "5-7/img.png"
        if id_animal == "Ушастый еж":
            return self.lines[15], "5-7/img_1.png"
        if id_animal == "Лебедь шипун":
            return self.lines[25], "5-7/img_2.png"
        if id_animal == "Чернозобая гагара":
            return self.lines[37], "5-7/img_3.png"
        if id_animal == "Красношейная поганка":
            return self.lines[38], "5-7/img_4.png"
